w9_rake_bundler/put_rake/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2024-11-09 Sat 14:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>puts Rakefile for a specific task</title>
<meta name="author" content="Shigeto R. Nishitani" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">puts Rakefile for a specific task</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge1e2acd">1. name</a></li>
<li><a href="#org6daf4f2">2. install</a></li>
<li><a href="#org7b97412">3. usage</a></li>
<li><a href="#org08efe7c">4. tldr</a>
<ul>
<li><a href="#org758bc82">4.1. put_rake for [EXT]</a></li>
<li><a href="#org7d766e5">4.2. put_rake add PATH</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge1e2acd" class="outline-2">
<h2 id="orge1e2acd"><span class="section-number-2">1.</span> name</h2>
<div class="outline-text-2" id="text-1">
<p>
Rakefileの雛形をpwdに置くgem.
</p>
</div>
</div>

<div id="outline-container-org6daf4f2" class="outline-2">
<h2 id="org6daf4f2"><span class="section-number-2">2.</span> install</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-shell">&gt; gem install put_rake
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b97412" class="outline-2">
<h2 id="org7b97412"><span class="section-number-2">3.</span> usage</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-shell">&gt; put_rake
put_rake commands:
  put_rake add PATH        <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">add Rakefile template PATH</span>
  put_rake for [EXT]       <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">put Rakefile for [EXT]</span>
  put_rake help [COMMAND]  <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">Describe available commands or one specific command</span>
  put_rake list            <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">list available Rakefiles</span>
  put_rake path            <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">show Rakefile template path</span>
  put_rake version         <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">show version</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org08efe7c" class="outline-2">
<h2 id="org08efe7c"><span class="section-number-2">4.</span> tldr</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org758bc82" class="outline-3">
<h3 id="org758bc82"><span class="section-number-3">4.1.</span> put_rake for [EXT]</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<code>put Rakefile for [EXT]</code>
</p>
</div>
</div>
<div id="outline-container-org7d766e5" class="outline-3">
<h3 id="org7d766e5"><span class="section-number-3">4.2.</span> put_rake add PATH</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<code>add Rakefile template PATH</code>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2024-11-09 Sat 14:25</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
